#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
#include <math.h>

int main()
{
    setlocale(LC_ALL,"ukr");
    int N ,
        i = 1,
        k = 1,
        l = 1,
        m = 0,
        A[100],
        max = 0,
        min = 0,
        x,
        sort=1;
    float   s1 = 0,
            s2 = 0,
            s3 = 0,
            s4 = 0;

    printf("Введiть довжину масиву N: ");
    scanf("%d", &N);
    printf("Введiть числа (натуральнi позитивнi та цiлi негативнi) для масиву А[%d]: \n ", N);
    for(i = 0; i < N; i++)
    {
        printf("A[%d]: ", i);
        scanf("%d", &A[i]);
    }
    printf("Елементи масиву A[N]: ");
    for(i = 0; i < N; i++) printf("%d, ", A[i]);


    printf("\n\n Обчислення середнього арифметичного окремо для позитивних та негативних чисел \n");
    for(i = 0; i < N; i++)
    {
        if(A[i] > 0)
        {
            s1 = s1 + A[i];
            s2 = s1 / k ;
            k++;
        }
        else
        {
            s3 = s3 + A[i];
            s4 = s3 / l ;
            l++;
        }
    }
    printf("Середнє арифметичне для позитивних чисел: s2 = %f \n", s2);
    printf("Середнє арифметичне для негативних чисел: s4 = %f \n\n", s4);

    printf("Пiдрахунок кiлькостi випадкiв, коли числа, що стоять поруч, мають рiзний знак: \n");
    for(i = 0; i < N; i++)
    {
        if(((A[i] > 0)&&(A[i+1] < 0))||((A[i] < 0)&&(A[i+1] > 0))) m++;
    }
printf("Кiлькiсть випадкiв, коли числа, що стоять поруч, мають рiзний знак: m = %d \n\n", m);

    printf("Знаходження найбiльшого числа серед позитивних i найменшого серед негативних: \n");
    for(i = 0; i < N; i++)
    {
        if(A[i] > 0 && A[i] > max) max = A[i];
        if(A[i] < 0 && A[i] < min) min = A[i];
    }
    printf("Найбiльше позитивне число: max = %d \n ", max);
    printf("Найменше негативне число: min = %d \n\n ", min);

    printf("Впорядкування позитивних чисел за зростанням, а потiм негетивних чисел за спаданням: \n");

    while(sort)
    {
        sort = 0;
        for(i = 1; i < N; i++)
        {
            if((A[i-1] >= 0 && A[i] >= 0 && A[i-1] > A[i]) || (A[i-1] < 0 && A[i] >= 0) || (A[i-1] < 0 && A[i] < 0 && A[i-1] < A[i]))
           {
               x = A[i-1];
               A[i-1] = A[i];
               A[i] = x;
               sort = 1;
           }
        }
    }

    printf("Елементи змiненого масиву A[N]: ");
    for(i = 0; i < N; i++) printf("%d ", A[i]);

    return 0;
}
